# Homebrew bundle for dotfiles (Apple Silicon).
# Regenerate with: brew bundle dump --file=Brewfile

tap "oven-sh/bun"

brew "bash"
brew "buf"
brew "cloud-sql-proxy"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "openjdk"
brew "openjdk@11"
brew "pinentry-mac"
brew "redis"
brew "ruby"
brew "starship"
brew "webp"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "oven-sh/bun/bun"

cask "adobe-creative-cloud"
cask "android-studio"
cask "chatgpt"
cask "cyberduck"
cask "docker-desktop"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "gcloud-cli"
cask "google-chrome"
cask "google-drive"
cask "kreya"
cask "raspberry-pi-imager"
cask "rive"
cask "tableplus"
cask "visual-studio-code"
cask "zed"
